### 1. Import the required libraries and read the dataset.

In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [5]:
data=pd.read_csv("Bank_loan.csv")
data.head(2)

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91107,4,1.6,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1.5,1,0,0,1,0,0,0

### 2. Check the first few samples, shape, info of the data and try to familiarize yourself with different features.

In [6]:
data.sample(5)

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
3872,3873,53,29,63,94720,2,1.0,3,0,0,0,0,1,0
2338,2339,42,18,130,94611,2,7.5,1,0,0,0,0,0,1
3468,3469,43,19,113,93933,2,1.8,2,0,0,0,0,0,1
1725,1726,57,32,19,95348,1,1.3,1,0,0,0,0,1,0
402,403,54,28,93,91604,1,4.9,1,133,0,0,1,1,1

In [7]:
data.shape

(5000, 14)

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   float64
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: float64(1), int64(13)
memory usage: 547.0 KB

### 3. Check if there are any duplicate records present in the dataset? If yes, drop them. and Drop the columns which you feel are redundant.

In [9]:
data.duplicated().sum()

0

In this data there is no duplicated values.

### 4. Display the Five Point Summary and write your key findings.

In [10]:
data.describe()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000,5000.000000,5000.000000
mean,2500.500000,45.338400,20.104600,73.774200,93152.503000,2.396400,1.937938,1.881000,56.498800,0.096000,0.104400,0.06040,0.596800,0.294000
std,1443.520003,11.463166,11.467954,46.033729,2121.852197,1.147663,1.747659,0.839869,101.713802,0.294621,0.305809,0.23825,0.490589,0.455637
min,1.000000,23.000000,-3.000000,8.000000,9307.000000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
25%,1250.750000,35.000000,10.000000,39.000000,91911.000000,1.000000,0.700000,1.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
50%,2500.500000,45.000000,20.000000,64.000000,93437.000000,2.000000,1.500000,2.000000,0.000000,0.000000,0.000000,0.00000,1.000000,0.000000
75%,3750.250000,55.000000,30.000000,98.000000,94608.000000,3.000000,2.500000,3.000000,101.000000,0.000000,0.000000,0.00000,1.000000,1.000000
max,5000.000000,67.000000,43.000000,224.000000,96651.000000,4.000000,10.000000,3.000000,635.000000,1.000000,1.000000,1.00000,1.000000,1.000000

Key Findings/Inference:

Age:
The average age of the customers in this bank is 45 years.
The min age of the the customer is 23 & max age is 67.

Experience:
The average experience of customers in the bank is 20 years.
Minimum we have 3 years of experience and maximum of 43 years of experience.

Income:
The average salary of customers in the bank is $ 73,774.
The minimum salary of customers are 8,000 and maximum is around 2,24,000.

Family:
On an average the size of the family is 2.4.
The minimum family size is 1 and max is 4.

CCAvg:
Avg spending on credit cards per month is $ 1937.
The spending range is between 0 to $ 1000.

Education:
Average customer of this bank fell under Graduate which is level 2.

Mortgage:
The average mortgage amount among customers in the dataset is $56,499, with a diverse range extending from 0 to 635,000.

Personal loan:
Approximately 9.6% of customers in the dataset have opted for a personal loan.

Security & Certificate of deposit A/c:
In terms of additional banking products, around 10.4% of customers hold a securities account, while approximately 6.0% have a certificate of deposit (CD) account.

Online:
The majority of customers, accounting for about 59.7%, utilize online banking services for their transactions.

Credit Card:
About 29.4% of customers make use of a credit card issued by the bank.

### 5 . There are negative values in the variable 'Experience'. Convert them to non-negative values. (Hint: .abs function)

In [11]:
data['Experience']=abs(data['Experience'])

In [12]:
data['Experience'].unique()

array([ 1, 19, 15,  9,  8, 13, 27, 24, 10, 39,  5, 23, 32, 41, 30, 14, 18,
       21, 28, 31, 11, 16, 20, 35,  6, 25,  7, 12, 26, 37, 17,  2, 36, 29,
        3, 22, 34,  0, 38, 40, 33,  4, 42, 43])

### 6. Get the target column distribution and comment on the class distribution.

In [13]:
data['Personal Loan'].value_counts()

Personal Loan
0    4520
1     480
Name: count, dtype: int64

Members with Personal Loan:
Number of members who have taken a personal loan: 480.

Members without Personal Loan:
Number of members who have not taken a personal loan: 4520

### 7. Store the target column (i.e.Personal Loan) in the y variable and the rest of the columns in the X variable.

In [14]:
x=data.drop(columns=['Personal Loan'],axis=1)
y=data['Personal Loan']

### 8. Split the dataset into two parts (i.e. 70% train and 30% test). and standardize the columns using the z-score scaling approach.

In [17]:
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn import metrics
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report

In [18]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3)

In [19]:
scaler=StandardScaler()
x_train_scaled=scaler.fit_transform(x_train)
x_test_scaled=scaler.fit_transform(x_test)

### 9. Train and test a Logistic Regression model to predict the likelihood of a liability customer buying personal loans. Display the train and test accuracy scores.

In [20]:
from sklearn.linear_model import LogisticRegression

In [21]:
model_accuracy=LogisticRegression()
model_accuracy.fit(x_train_scaled,y_train)

train_prediction=model_accuracy.predict(x_train)
test_prediction=model_accuracy.predict(x_test)

train_accuracy=accuracy_score(y_train,train_prediction)
test_accuracy=accuracy_score(y_test,test_prediction)

print("Train Accuracy:",train_accuracy)
print("Test Accuracy:",test_accuracy)

Train Accuracy: 0.09714285714285714
Test Accuracy: 0.09333333333333334

### 10. Print the confusion matrix and classification report for the model and write your conclusions on the results.

In [22]:
conf_matrix=confusion_matrix(y_test,test_prediction)
class_report=classification_report(y_test,test_prediction)

print("Confusion Matrix:","\n",conf_matrix)
print("")
print("Classification Report:",'\n',class_report)

Confusion Matrix:
 [[   0 1360]
 [   0  140]]

Classification Report:
               precision    recall  f1-score   support

           0       0.00      0.00      0.00      1360
           1       0.09      1.00      0.17       140

    accuracy                           0.09      1500
   macro avg       0.05      0.50      0.09      1500
weighted avg       0.01      0.09      0.02      1500